In [2]:
import os
import sys
# to import the files in path
module_path = os.path.abspath(os.path.join('..'))
if module_path not in sys.path:
    sys.path.append(module_path)
    
from src.orthanc_scrapper import *
from src.kz.kz_bi import *
from src.kz.krisha import *
logging.getLogger('WDM').setLevel(logging.NOTSET)

In [3]:
city = 'astana'
jk_name = 'Nexpo'
scrap_krisha(city,jk_name)

,Floor,Number Of Floors,Surface,Price,Entrance,Link
0,10,16,39.0,30800000,na,https://krisha.kz/a/show/679312112
0,16,16,39.0,32000000,na,https://krisha.kz/a/show/678928238

In [4]:
scrap_krisha(city,'Aqua')

,Floor,Number Of Floors,Surface,Price,Entrance,Link
0,5,9,42.82,25500000,na,https://krisha.kz/a/show/679522813
0,8,12,41.39,25000000,na,https://krisha.kz/a/show/678304025